kuafusoft/source_code/application/jqgrid/mcu/zzvw_device_ver/mcu_header_file/CWMCUS_V10_6_Kinetis_50MHz_KM1x_KM3x_FINAL_DROP_140717/_Test_Files/Test_MKM14Z5_v1_2.c
void test_CoreDebug(void) {
  (void)CoreDebug_BASE_PTR;
  DHCSR_Read = DHCSR_Read + 1;
  DHCSR_Write = DHCSR_Write + 1;
  DCRSR = DCRSR + 1;
  DCRDR = DCRDR + 1;
  DEMCR = DEMCR + 1;
  CoreDebug_base_DHCSR_Read_REG(CoreDebug_BASE_PTR) = CoreDebug_base_DHCSR_Read_REG(CoreDebug_BASE_PTR) + 1;
  CoreDebug_base_DHCSR_Write_REG(CoreDebug_BASE_PTR) = CoreDebug_base_DHCSR_Write_REG(CoreDebug_BASE_PTR) + 1;
  CoreDebug_base_DCRSR_REG(CoreDebug_BASE_PTR) = CoreDebug_base_DCRSR_REG(CoreDebug_BASE_PTR) + 1;
  CoreDebug_base_DCRDR_REG(CoreDebug_BASE_PTR) = CoreDebug_base_DCRDR_REG(CoreDebug_BASE_PTR) + 1;
  CoreDebug_base_DEMCR_REG(CoreDebug_BASE_PTR) = CoreDebug_base_DEMCR_REG(CoreDebug_BASE_PTR) + 1;
}

void test_DMA(void) {
  (void)DMA_BASE_PTR;
  DMA_SAR0 = DMA_SAR0 + 1;
  DMA_DAR0 = DMA_DAR0 + 1;
  DMA_DSR_BCR0 = DMA_DSR_BCR0 + 1;
  DMA_DSR0 = DMA_DSR0 + 1;
  DMA_DCR0 = DMA_DCR0 + 1;
  DMA_SAR1 = DMA_SAR1 + 1;
  DMA_DAR1 = DMA_DAR1 + 1;
  DMA_DSR_BCR1 = DMA_DSR_BCR1 + 1;
  DMA_DSR1 = DMA_DSR1 + 1;
  DMA_DCR1 = DMA_DCR1 + 1;
  DMA_SAR2 = DMA_SAR2 + 1;
  DMA_DAR2 = DMA_DAR2 + 1;
  DMA_DSR_BCR2 = DMA_DSR_BCR2 + 1;
  DMA_DSR2 = DMA_DSR2 + 1;
  DMA_DCR2 = DMA_DCR2 + 1;
  DMA_SAR3 = DMA_SAR3 + 1;
  DMA_DAR3 = DMA_DAR3 + 1;
  DMA_DSR_BCR3 = DMA_DSR_BCR3 + 1;
  DMA_DSR3 = DMA_DSR3 + 1;
  DMA_DCR3 = DMA_DCR3 + 1;
  DMA_SAR_REG(DMA_BASE_PTR,0) = DMA_SAR_REG(DMA_BASE_PTR,0) + 1;
  DMA_SAR(0) = DMA_SAR(0) + 1;
  (void)DMA_SAR_SAR_MASK;
  (void)DMA_SAR_SAR_SHIFT;
  (void)DMA_SAR_SAR(1);
  DMA_SAR0 |= DMA_SAR_SAR_MASK;
  DMA_SAR0 &= ~(1U << DMA_SAR_SAR_SHIFT);
  DMA_DAR_REG(DMA_BASE_PTR,0) = DMA_DAR_REG(DMA_BASE_PTR,0) + 1;
  DMA_DAR(0) = DMA_DAR(0) + 1;
  (void)DMA_DAR_DAR_MASK;
  (void)DMA_DAR_DAR_SHIFT;
  (void)DMA_DAR_DAR(1);
  DMA_DAR0 |= DMA_DAR_DAR_MASK;
  DMA_DAR0 &= ~(1U << DMA_DAR_DAR_SHIFT);
  DMA_DSR_BCR_REG(DMA_BASE_PTR,0) = DMA_DSR_BCR_REG(DMA_BASE_PTR,0) + 1;
  DMA_DSR_BCR(0) = DMA_DSR_BCR(0) + 1;
  (void)DMA_DSR_BCR_BCR_MASK;
  (void)DMA_DSR_BCR_BCR_SHIFT;
  (void)DMA_DSR_BCR_BCR(1);
  DMA_DSR_BCR0 |= DMA_DSR_BCR_BCR_MASK;
  DMA_DSR_BCR0 &= ~(1U << DMA_DSR_BCR_BCR_SHIFT);
  (void)DMA_DSR_BCR_DONE_MASK;
  (void)DMA_DSR_BCR_DONE_SHIFT;
  DMA_DSR_BCR0 |= DMA_DSR_BCR_DONE_MASK;
  DMA_DSR_BCR0 &= ~(1U << DMA_DSR_BCR_DONE_SHIFT);
  (void)DMA_DSR_BCR_BSY_MASK;
  (void)DMA_DSR_BCR_BSY_SHIFT;
  DMA_DSR_BCR0 |= DMA_DSR_BCR_BSY_MASK;
  DMA_DSR_BCR0 &= ~(1U << DMA_DSR_BCR_BSY_SHIFT);
  (void)DMA_DSR_BCR_REQ_MASK;
  (void)DMA_DSR_BCR_REQ_SHIFT;
  DMA_DSR_BCR0 |= DMA_DSR_BCR_REQ_MASK;
  DMA_DSR_BCR0 &= ~(1U << DMA_DSR_BCR_REQ_SHIFT);
  (void)DMA_DSR_BCR_BED_MASK;
  (void)DMA_DSR_BCR_BED_SHIFT;
  DMA_DSR_BCR0 |= DMA_DSR_BCR_BED_MASK;
  DMA_DSR_BCR0 &= ~(1U << DMA_DSR_BCR_BED_SHIFT);
  (void)DMA_DSR_BCR_BES_MASK;
  (void)DMA_DSR_BCR_BES_SHIFT;
  DMA_DSR_BCR0 |= DMA_DSR_BCR_BES_MASK;
  DMA_DSR_BCR0 &= ~(1U << DMA_DSR_BCR_BES_SHIFT);
  (void)DMA_DSR_BCR_CE_MASK;
  (void)DMA_DSR_BCR_CE_SHIFT;
  DMA_DSR_BCR0 |= DMA_DSR_BCR_CE_MASK;
  DMA_DSR_BCR0 &= ~(1U << DMA_DSR_BCR_CE_SHIFT);
  DMA_DSR_REG(DMA_BASE_PTR,0) = DMA_DSR_REG(DMA_BASE_PTR,0) + 1;
  DMA_DSR(0) = DMA_DSR(0) + 1;
  DMA_DCR_REG(DMA_BASE_PTR,0) = DMA_DCR_REG(DMA_BASE_PTR,0) + 1;
  DMA_DCR(0) = DMA_DCR(0) + 1;
  (void)DMA_DCR_LCH2_MASK;
  (void)DMA_DCR_LCH2_SHIFT;
  (void)DMA_DCR_LCH2(1);
  DMA_DCR0 |= DMA_DCR_LCH2_MASK;
  DMA_DCR0 &= ~(1U << DMA_DCR_LCH2_SHIFT);
  (void)DMA_DCR_LCH1_MASK;
  (void)DMA_DCR_LCH1_SHIFT;
  (void)DMA_DCR_LCH1(1);
  DMA_DCR0 |= DMA_DCR_LCH1_MASK;
  DMA_DCR0 &= ~(1U << DMA_DCR_LCH1_SHIFT);
  (void)DMA_DCR_LINKCC_MASK;
  (void)DMA_DCR_LINKCC_SHIFT;
  (void)DMA_DCR_LINKCC(1);
  DMA_DCR0 |= DMA_DCR_LINKCC_MASK;
  DMA_DCR0 &= ~(1U << DMA_DCR_LINKCC_SHIFT);
  (void)DMA_DCR_D_REQ_MASK;
  (void)DMA_DCR_D_REQ_SHIFT;
  DMA_DCR0 |= DMA_DCR_D_REQ_MASK;
  DMA_DCR0 &= ~(1U << DMA_DCR_D_REQ_SHIFT);
  (void)DMA_DCR_DMOD_MASK;
  (void)DMA_DCR_DMOD_SHIFT;
  (void)DMA_DCR_DMOD(1);
  DMA_DCR0 |= DMA_DCR_DMOD_MASK;
  DMA_DCR0 &= ~(1U << DMA_DCR_DMOD_SHIFT);
  (void)DMA_DCR_SMOD_MASK;
  (void)DMA_DCR_SMOD_SHIFT;
  (void)DMA_DCR_SMOD(1);
  DMA_DCR0 |= DMA_DCR_SMOD_MASK;
  DMA_DCR0 &= ~(1U << DMA_DCR_SMOD_SHIFT);
  (void)DMA_DCR_START_MASK;
  (void)DMA_DCR_START_SHIFT;
  DMA_DCR0 |= DMA_DCR_START_MASK;
  DMA_DCR0 &= ~(1U << DMA_DCR_START_SHIFT);
  (void)DMA_DCR_DSIZE_MASK;
  (void)DMA_DCR_DSIZE_SHIFT;
  (void)DMA_DCR_DSIZE(1);
  DMA_DCR0 |= DMA_DCR_DSIZE_MASK;
  DMA_DCR0 &= ~(1U << DMA_DCR_DSIZE_SHIFT);
  (void)DMA_DCR_DINC_MASK;
  (void)DMA_DCR_DINC_SHIFT;
  DMA_DCR0 |= DMA_DCR_DINC_MASK;
  DMA_DCR0 &= ~(1U << DMA_DCR_DINC_SHIFT);
  (void)DMA_DCR_SSIZE_MASK;
  (void)DMA_DCR_SSIZE_SHIFT;
  (void)DMA_DCR_SSIZE(1);
  DMA_DCR0 |= DMA_DCR_SSIZE_MASK;
  DMA_DCR0 &= ~(1U << DMA_DCR_SSIZE_SHIFT);
  (void)DMA_DCR_SINC_MASK;
  (void)DMA_DCR_SINC_SHIFT;
  DMA_DCR0 |= DMA_DCR_SINC_MASK;
  DMA_DCR0 &= ~(1U << DMA_DCR_SINC_SHIFT);
  (void)DMA_DCR_EADREQ_MASK;
  (void)DMA_DCR_EADREQ_SHIFT;
  DMA_DCR0 |= DMA_DCR_EADREQ_MASK;
  DMA_DCR0 &= ~(1U << DMA_DCR_EADREQ_SHIFT);
  (void)DMA_DCR_UMNSM_MASK;
  (void)DMA_DCR_UMNSM_SHIFT;
  (void)DMA_DCR_UMNSM(1);
  DMA_DCR0 |= DMA_DCR_UMNSM_MASK;
  DMA_DCR0 &= ~(1U << DMA_DCR_UMNSM_SHIFT);
  (void)DMA_DCR_CHACR_MASK;
  (void)DMA_DCR_CHACR_SHIFT;
  (void)DMA_DCR_CHACR(1);
  DMA_DCR0 |= DMA_DCR_CHACR_MASK;
  DMA_DCR0 &= ~(1U << DMA_DCR_CHACR_SHIFT);
  (void)DMA_DCR_AA_MASK;
  (void)DMA_DCR_AA_SHIFT;
  DMA_DCR0 |= DMA_DCR_AA_MASK;
  DMA_DCR0 &= ~(1U << DMA_DCR_AA_SHIFT);
  (void)DMA_DCR_CS_MASK;
  (void)DMA_DCR_CS_SHIFT;
  DMA_DCR0 |= DMA_DCR_CS_MASK;
  DMA_DCR0 &= ~(1U << DMA_DCR_CS_SHIFT);
  (void)DMA_DCR_ERQ_MASK;
  (void)DMA_DCR_ERQ_SHIFT;
  DMA_DCR0 |= DMA_DCR_ERQ_MASK;
  DMA_DCR0 &= ~(1U << DMA_DCR_ERQ_SHIFT);
  (void)DMA_DCR_EINT_MASK;
  (void)DMA_DCR_EINT_SHIFT;
  DMA_DCR0 |= DMA_DCR_EINT_MASK;
  DMA_DCR0 &= ~(1U << DMA_DCR_EINT_SHIFT);
}

void test_DMAMUX(void) {
  (void)DMAMUX0_BASE_PTR;
  (void)DMAMUX1_BASE_PTR;
  (void)DMAMUX2_BASE_PTR;
  (void)DMAMUX3_BASE_PTR;
  DMAMUX0_CHCFG = DMAMUX0_CHCFG + 1;
  DMAMUX1_CHCFG = DMAMUX1_CHCFG + 1;
  DMAMUX2_CHCFG = DMAMUX2_CHCFG + 1;
  DMAMUX3_CHCFG = DMAMUX3_CHCFG + 1;
  DMAMUX_CHCFG_REG(DMAMUX0_BASE_PTR) = DMAMUX_CHCFG_REG(DMAMUX0_BASE_PTR) + 1;
  DMAMUX_CHCFG_REG(DMAMUX1_BASE_PTR) = DMAMUX_CHCFG_REG(DMAMUX1_BASE_PTR) + 1;
  DMAMUX_CHCFG_REG(DMAMUX2_BASE_PTR) = DMAMUX_CHCFG_REG(DMAMUX2_BASE_PTR) + 1;
  DMAMUX_CHCFG_REG(DMAMUX3_BASE_PTR) = DMAMUX_CHCFG_REG(DMAMUX3_BASE_PTR) + 1;
  (void)DMAMUX_CHCFG_SOURCE_MASK;
  (void)DMAMUX_CHCFG_SOURCE_SHIFT;
  (void)DMAMUX_CHCFG_SOURCE(1);
  DMAMUX0_CHCFG |= DMAMUX_CHCFG_SOURCE_MASK;
  DMAMUX0_CHCFG &= ~(1U << DMAMUX_CHCFG_SOURCE_SHIFT);
  (void)DMAMUX_CHCFG_TRIG_MASK;
  (void)DMAMUX_CHCFG_TRIG_SHIFT;
  DMAMUX0_CHCFG |= DMAMUX_CHCFG_TRIG_MASK;
  DMAMUX0_CHCFG &= ~(1U << DMAMUX_CHCFG_TRIG_SHIFT);
  (void)DMAMUX_CHCFG_ENBL_MASK;
  (void)DMAMUX_CHCFG_ENBL_SHIFT;
  DMAMUX0_CHCFG |= DMAMUX_CHCFG_ENBL_MASK;
  DMAMUX0_CHCFG &= ~(1U << DMAMUX_CHCFG_ENBL_SHIFT);
}

