kuafusoft/source_code/application/jqgrid/mcu/zzvw_device_ver/mcu_header_file/CWMCUS_V10_6_Kinetis_50MHz_KM1x_KM3x_FINAL_DROP_140717/_Test_Files/Test_MKM14Z5_v1_2.c
void test_MCG(void) {
  (void)MCG_BASE_PTR;
  MCG_C1 = MCG_C1 + 1;
  MCG_C2 = MCG_C2 + 1;
  MCG_C3 = MCG_C3 + 1;
  MCG_C4 = MCG_C4 + 1;
  MCG_C5 = MCG_C5 + 1;
  MCG_C6 = MCG_C6 + 1;
  MCG_S = MCG_S + 1;
  MCG_SC = MCG_SC + 1;
  MCG_ATCVH = MCG_ATCVH + 1;
  MCG_ATCVL = MCG_ATCVL + 1;
  MCG_C7 = MCG_C7 + 1;
  MCG_C8 = MCG_C8 + 1;
  MCG_C1_REG(MCG_BASE_PTR) = MCG_C1_REG(MCG_BASE_PTR) + 1;
  (void)MCG_C1_IREFSTEN_MASK;
  (void)MCG_C1_IREFSTEN_SHIFT;
  MCG_C1 |= MCG_C1_IREFSTEN_MASK;
  MCG_C1 &= ~(1U << MCG_C1_IREFSTEN_SHIFT);
  (void)MCG_C1_IRCLKEN_MASK;
  (void)MCG_C1_IRCLKEN_SHIFT;
  MCG_C1 |= MCG_C1_IRCLKEN_MASK;
  MCG_C1 &= ~(1U << MCG_C1_IRCLKEN_SHIFT);
  (void)MCG_C1_IREFS_MASK;
  (void)MCG_C1_IREFS_SHIFT;
  MCG_C1 |= MCG_C1_IREFS_MASK;
  MCG_C1 &= ~(1U << MCG_C1_IREFS_SHIFT);
  (void)MCG_C1_FRDIV_MASK;
  (void)MCG_C1_FRDIV_SHIFT;
  (void)MCG_C1_FRDIV(1);
  MCG_C1 |= MCG_C1_FRDIV_MASK;
  MCG_C1 &= ~(1U << MCG_C1_FRDIV_SHIFT);
  (void)MCG_C1_CLKS_MASK;
  (void)MCG_C1_CLKS_SHIFT;
  (void)MCG_C1_CLKS(1);
  MCG_C1 |= MCG_C1_CLKS_MASK;
  MCG_C1 &= ~(1U << MCG_C1_CLKS_SHIFT);
  MCG_C2_REG(MCG_BASE_PTR) = MCG_C2_REG(MCG_BASE_PTR) + 1;
  (void)MCG_C2_IRCS_MASK;
  (void)MCG_C2_IRCS_SHIFT;
  MCG_C2 |= MCG_C2_IRCS_MASK;
  MCG_C2 &= ~(1U << MCG_C2_IRCS_SHIFT);
  (void)MCG_C2_LP_MASK;
  (void)MCG_C2_LP_SHIFT;
  MCG_C2 |= MCG_C2_LP_MASK;
  MCG_C2 &= ~(1U << MCG_C2_LP_SHIFT);
  (void)MCG_C2_EREFS0_MASK;
  (void)MCG_C2_EREFS0_SHIFT;
  MCG_C2 |= MCG_C2_EREFS0_MASK;
  MCG_C2 &= ~(1U << MCG_C2_EREFS0_SHIFT);
  (void)MCG_C2_HGO0_MASK;
  (void)MCG_C2_HGO0_SHIFT;
  MCG_C2 |= MCG_C2_HGO0_MASK;
  MCG_C2 &= ~(1U << MCG_C2_HGO0_SHIFT);
  (void)MCG_C2_RANGE0_MASK;
  (void)MCG_C2_RANGE0_SHIFT;
  (void)MCG_C2_RANGE0(1);
  MCG_C2 |= MCG_C2_RANGE0_MASK;
  MCG_C2 &= ~(1U << MCG_C2_RANGE0_SHIFT);
  (void)MCG_C2_LOCRE0_MASK;
  (void)MCG_C2_LOCRE0_SHIFT;
  MCG_C2 |= MCG_C2_LOCRE0_MASK;
  MCG_C2 &= ~(1U << MCG_C2_LOCRE0_SHIFT);
  MCG_C3_REG(MCG_BASE_PTR) = MCG_C3_REG(MCG_BASE_PTR) + 1;
  (void)MCG_C3_SCTRIM_MASK;
  (void)MCG_C3_SCTRIM_SHIFT;
  (void)MCG_C3_SCTRIM(1);
  MCG_C3 |= MCG_C3_SCTRIM_MASK;
  MCG_C3 &= ~(1U << MCG_C3_SCTRIM_SHIFT);
  MCG_C4_REG(MCG_BASE_PTR) = MCG_C4_REG(MCG_BASE_PTR) + 1;
  (void)MCG_C4_SCFTRIM_MASK;
  (void)MCG_C4_SCFTRIM_SHIFT;
  MCG_C4 |= MCG_C4_SCFTRIM_MASK;
  MCG_C4 &= ~(1U << MCG_C4_SCFTRIM_SHIFT);
  (void)MCG_C4_FCTRIM_MASK;
  (void)MCG_C4_FCTRIM_SHIFT;
  (void)MCG_C4_FCTRIM(1);
  MCG_C4 |= MCG_C4_FCTRIM_MASK;
  MCG_C4 &= ~(1U << MCG_C4_FCTRIM_SHIFT);
  (void)MCG_C4_DRST_DRS_MASK;
  (void)MCG_C4_DRST_DRS_SHIFT;
  (void)MCG_C4_DRST_DRS(1);
  MCG_C4 |= MCG_C4_DRST_DRS_MASK;
  MCG_C4 &= ~(1U << MCG_C4_DRST_DRS_SHIFT);
  (void)MCG_C4_DMX32_MASK;
  (void)MCG_C4_DMX32_SHIFT;
  MCG_C4 |= MCG_C4_DMX32_MASK;
  MCG_C4 &= ~(1U << MCG_C4_DMX32_SHIFT);
  MCG_C5_REG(MCG_BASE_PTR) = MCG_C5_REG(MCG_BASE_PTR) + 1;
  (void)MCG_C5_PLLSTEN0_MASK;
  (void)MCG_C5_PLLSTEN0_SHIFT;
  MCG_C5 |= MCG_C5_PLLSTEN0_MASK;
  MCG_C5 &= ~(1U << MCG_C5_PLLSTEN0_SHIFT);
  (void)MCG_C5_PLLCLKEN0_MASK;
  (void)MCG_C5_PLLCLKEN0_SHIFT;
  MCG_C5 |= MCG_C5_PLLCLKEN0_MASK;
  MCG_C5 &= ~(1U << MCG_C5_PLLCLKEN0_SHIFT);
  MCG_C6_REG(MCG_BASE_PTR) = MCG_C6_REG(MCG_BASE_PTR) + 1;
  (void)MCG_C6_CHGPMP_BIAS_MASK;
  (void)MCG_C6_CHGPMP_BIAS_SHIFT;
  (void)MCG_C6_CHGPMP_BIAS(1);
  MCG_C6 |= MCG_C6_CHGPMP_BIAS_MASK;
  MCG_C6 &= ~(1U << MCG_C6_CHGPMP_BIAS_SHIFT);
  (void)MCG_C6_CME0_MASK;
  (void)MCG_C6_CME0_SHIFT;
  MCG_C6 |= MCG_C6_CME0_MASK;
  MCG_C6 &= ~(1U << MCG_C6_CME0_SHIFT);
  (void)MCG_C6_PLLS_MASK;
  (void)MCG_C6_PLLS_SHIFT;
  MCG_C6 |= MCG_C6_PLLS_MASK;
  MCG_C6 &= ~(1U << MCG_C6_PLLS_SHIFT);
  (void)MCG_C6_LOLIE0_MASK;
  (void)MCG_C6_LOLIE0_SHIFT;
  MCG_C6 |= MCG_C6_LOLIE0_MASK;
  MCG_C6 &= ~(1U << MCG_C6_LOLIE0_SHIFT);
  MCG_S_REG(MCG_BASE_PTR) = MCG_S_REG(MCG_BASE_PTR) + 1;
  (void)MCG_S_IRCST_MASK;
  (void)MCG_S_IRCST_SHIFT;
  MCG_S |= MCG_S_IRCST_MASK;
  MCG_S &= ~(1U << MCG_S_IRCST_SHIFT);
  (void)MCG_S_OSCINIT0_MASK;
  (void)MCG_S_OSCINIT0_SHIFT;
  MCG_S |= MCG_S_OSCINIT0_MASK;
  MCG_S &= ~(1U << MCG_S_OSCINIT0_SHIFT);
  (void)MCG_S_CLKST_MASK;
  (void)MCG_S_CLKST_SHIFT;
  (void)MCG_S_CLKST(1);
  MCG_S |= MCG_S_CLKST_MASK;
  MCG_S &= ~(1U << MCG_S_CLKST_SHIFT);
  (void)MCG_S_IREFST_MASK;
  (void)MCG_S_IREFST_SHIFT;
  MCG_S |= MCG_S_IREFST_MASK;
  MCG_S &= ~(1U << MCG_S_IREFST_SHIFT);
  (void)MCG_S_PLLST_MASK;
  (void)MCG_S_PLLST_SHIFT;
  MCG_S |= MCG_S_PLLST_MASK;
  MCG_S &= ~(1U << MCG_S_PLLST_SHIFT);
  (void)MCG_S_LOCK0_MASK;
  (void)MCG_S_LOCK0_SHIFT;
  MCG_S |= MCG_S_LOCK0_MASK;
  MCG_S &= ~(1U << MCG_S_LOCK0_SHIFT);
  (void)MCG_S_LOLS0_MASK;
  (void)MCG_S_LOLS0_SHIFT;
  MCG_S |= MCG_S_LOLS0_MASK;
  MCG_S &= ~(1U << MCG_S_LOLS0_SHIFT);
  MCG_SC_REG(MCG_BASE_PTR) = MCG_SC_REG(MCG_BASE_PTR) + 1;
  (void)MCG_SC_LOCS0_MASK;
  (void)MCG_SC_LOCS0_SHIFT;
  MCG_SC |= MCG_SC_LOCS0_MASK;
  MCG_SC &= ~(1U << MCG_SC_LOCS0_SHIFT);
  (void)MCG_SC_FCRDIV_MASK;
  (void)MCG_SC_FCRDIV_SHIFT;
  (void)MCG_SC_FCRDIV(1);
  MCG_SC |= MCG_SC_FCRDIV_MASK;
  MCG_SC &= ~(1U << MCG_SC_FCRDIV_SHIFT);
  (void)MCG_SC_FLTPRSRV_MASK;
  (void)MCG_SC_FLTPRSRV_SHIFT;
  MCG_SC |= MCG_SC_FLTPRSRV_MASK;
  MCG_SC &= ~(1U << MCG_SC_FLTPRSRV_SHIFT);
  (void)MCG_SC_ATMF_MASK;
  (void)MCG_SC_ATMF_SHIFT;
  MCG_SC |= MCG_SC_ATMF_MASK;
  MCG_SC &= ~(1U << MCG_SC_ATMF_SHIFT);
  (void)MCG_SC_ATMS_MASK;
  (void)MCG_SC_ATMS_SHIFT;
  MCG_SC |= MCG_SC_ATMS_MASK;
  MCG_SC &= ~(1U << MCG_SC_ATMS_SHIFT);
  (void)MCG_SC_ATME_MASK;
  (void)MCG_SC_ATME_SHIFT;
  MCG_SC |= MCG_SC_ATME_MASK;
  MCG_SC &= ~(1U << MCG_SC_ATME_SHIFT);
  MCG_ATCVH_REG(MCG_BASE_PTR) = MCG_ATCVH_REG(MCG_BASE_PTR) + 1;
  (void)MCG_ATCVH_ATCVH_MASK;
  (void)MCG_ATCVH_ATCVH_SHIFT;
  (void)MCG_ATCVH_ATCVH(1);
  MCG_ATCVH |= MCG_ATCVH_ATCVH_MASK;
  MCG_ATCVH &= ~(1U << MCG_ATCVH_ATCVH_SHIFT);
  MCG_ATCVL_REG(MCG_BASE_PTR) = MCG_ATCVL_REG(MCG_BASE_PTR) + 1;
  (void)MCG_ATCVL_ATCVL_MASK;
  (void)MCG_ATCVL_ATCVL_SHIFT;
  (void)MCG_ATCVL_ATCVL(1);
  MCG_ATCVL |= MCG_ATCVL_ATCVL_MASK;
  MCG_ATCVL &= ~(1U << MCG_ATCVL_ATCVL_SHIFT);
  MCG_C7_REG(MCG_BASE_PTR) = MCG_C7_REG(MCG_BASE_PTR) + 1;
  (void)MCG_C7_OSCSEL_MASK;
  (void)MCG_C7_OSCSEL_SHIFT;
  MCG_C7 |= MCG_C7_OSCSEL_MASK;
  MCG_C7 &= ~(1U << MCG_C7_OSCSEL_SHIFT);
  (void)MCG_C7_PLL32KREFSEL_MASK;
  (void)MCG_C7_PLL32KREFSEL_SHIFT;
  (void)MCG_C7_PLL32KREFSEL(1);
  MCG_C7 |= MCG_C7_PLL32KREFSEL_MASK;
  MCG_C7 &= ~(1U << MCG_C7_PLL32KREFSEL_SHIFT);
  MCG_C8_REG(MCG_BASE_PTR) = MCG_C8_REG(MCG_BASE_PTR) + 1;
  (void)MCG_C8_LOCS1_MASK;
  (void)MCG_C8_LOCS1_SHIFT;
  MCG_C8 |= MCG_C8_LOCS1_MASK;
  MCG_C8 &= ~(1U << MCG_C8_LOCS1_SHIFT);
  (void)MCG_C8_COARSE_LOLIE_MASK;
  (void)MCG_C8_COARSE_LOLIE_SHIFT;
  MCG_C8 |= MCG_C8_COARSE_LOLIE_MASK;
  MCG_C8 &= ~(1U << MCG_C8_COARSE_LOLIE_SHIFT);
  (void)MCG_C8_CME1_MASK;
  (void)MCG_C8_CME1_SHIFT;
  MCG_C8 |= MCG_C8_CME1_MASK;
  MCG_C8 &= ~(1U << MCG_C8_CME1_SHIFT);
  (void)MCG_C8_LOLRE_MASK;
  (void)MCG_C8_LOLRE_SHIFT;
  MCG_C8 |= MCG_C8_LOLRE_MASK;
  MCG_C8 &= ~(1U << MCG_C8_LOLRE_SHIFT);
  (void)MCG_C8_LOCRE1_MASK;
  (void)MCG_C8_LOCRE1_SHIFT;
  MCG_C8 |= MCG_C8_LOCRE1_MASK;
  MCG_C8 &= ~(1U << MCG_C8_LOCRE1_SHIFT);
  (void)MCG_C9_COARSE_LOCK_MASK;
  (void)MCG_C9_COARSE_LOCK_SHIFT;
  MCG_C9 |= MCG_C9_COARSE_LOCK_MASK;
  MCG_C9 &= ~(1U << MCG_C9_COARSE_LOCK_SHIFT);
  (void)MCG_C9_COARSE_LOLS_MASK;
  (void)MCG_C9_COARSE_LOLS_SHIFT;
  MCG_C9 |= MCG_C9_COARSE_LOLS_MASK;
  MCG_C9 &= ~(1U << MCG_C9_COARSE_LOLS_SHIFT);
}

void test_MCM(void) {
  (void)MCM_BASE_PTR;
  MCM_PLACR = MCM_PLACR + 1;
  MCM_PID = MCM_PID + 1;
  MCM_CPO = MCM_CPO + 1;
  MCM_MATCR0 = MCM_MATCR0 + 1;
  (void)MCM_PLASC_ASC_MASK;
  (void)MCM_PLASC_ASC_SHIFT;
  (void)MCM_PLASC_ASC(1);
  MCM_PLASC |= MCM_PLASC_ASC_MASK;
  MCM_PLASC &= ~(1U << MCM_PLASC_ASC_SHIFT);
  (void)MCM_PLAMC_AMC_MASK;
  (void)MCM_PLAMC_AMC_SHIFT;
  (void)MCM_PLAMC_AMC(1);
  MCM_PLAMC |= MCM_PLAMC_AMC_MASK;
  MCM_PLAMC &= ~(1U << MCM_PLAMC_AMC_SHIFT);
  MCM_PLACR_REG(MCM_BASE_PTR) = MCM_PLACR_REG(MCM_BASE_PTR) + 1;
  (void)MCM_PLACR_ARB_MASK;
  (void)MCM_PLACR_ARB_SHIFT;
  MCM_PLACR |= MCM_PLACR_ARB_MASK;
  MCM_PLACR &= ~(1U << MCM_PLACR_ARB_SHIFT);
  (void)MCM_PLACR_CFCC_MASK;
  (void)MCM_PLACR_CFCC_SHIFT;
  MCM_PLACR |= MCM_PLACR_CFCC_MASK;
  MCM_PLACR &= ~(1U << MCM_PLACR_CFCC_SHIFT);
  (void)MCM_PLACR_DFCDA_MASK;
  (void)MCM_PLACR_DFCDA_SHIFT;
  MCM_PLACR |= MCM_PLACR_DFCDA_MASK;
  MCM_PLACR &= ~(1U << MCM_PLACR_DFCDA_SHIFT);
  (void)MCM_PLACR_DFCIC_MASK;
  (void)MCM_PLACR_DFCIC_SHIFT;
  MCM_PLACR |= MCM_PLACR_DFCIC_MASK;
  MCM_PLACR &= ~(1U << MCM_PLACR_DFCIC_SHIFT);
  (void)MCM_PLACR_DFCC_MASK;
  (void)MCM_PLACR_DFCC_SHIFT;
  MCM_PLACR |= MCM_PLACR_DFCC_MASK;
  MCM_PLACR &= ~(1U << MCM_PLACR_DFCC_SHIFT);
  (void)MCM_PLACR_EFDS_MASK;
  (void)MCM_PLACR_EFDS_SHIFT;
  MCM_PLACR |= MCM_PLACR_EFDS_MASK;
  MCM_PLACR &= ~(1U << MCM_PLACR_EFDS_SHIFT);
  (void)MCM_PLACR_DFCS_MASK;
  (void)MCM_PLACR_DFCS_SHIFT;
  MCM_PLACR |= MCM_PLACR_DFCS_MASK;
  MCM_PLACR &= ~(1U << MCM_PLACR_DFCS_SHIFT);
  (void)MCM_PLACR_ESFC_MASK;
  (void)MCM_PLACR_ESFC_SHIFT;
  MCM_PLACR |= MCM_PLACR_ESFC_MASK;
  MCM_PLACR &= ~(1U << MCM_PLACR_ESFC_SHIFT);
  MCM_PID_REG(MCM_BASE_PTR) = MCM_PID_REG(MCM_BASE_PTR) + 1;
  (void)MCM_PID_PID_MASK;
  (void)MCM_PID_PID_SHIFT;
  (void)MCM_PID_PID(1);
  MCM_PID |= MCM_PID_PID_MASK;
  MCM_PID &= ~(1U << MCM_PID_PID_SHIFT);
  MCM_CPO_REG(MCM_BASE_PTR) = MCM_CPO_REG(MCM_BASE_PTR) + 1;
  (void)MCM_CPO_CPOREQ_MASK;
  (void)MCM_CPO_CPOREQ_SHIFT;
  MCM_CPO |= MCM_CPO_CPOREQ_MASK;
  MCM_CPO &= ~(1U << MCM_CPO_CPOREQ_SHIFT);
  (void)MCM_CPO_CPOACK_MASK;
  (void)MCM_CPO_CPOACK_SHIFT;
  MCM_CPO |= MCM_CPO_CPOACK_MASK;
  MCM_CPO &= ~(1U << MCM_CPO_CPOACK_SHIFT);
  (void)MCM_CPO_CPOWOI_MASK;
  (void)MCM_CPO_CPOWOI_SHIFT;
  MCM_CPO |= MCM_CPO_CPOWOI_MASK;
  MCM_CPO &= ~(1U << MCM_CPO_CPOWOI_SHIFT);
  MCM_MATCR_REG(MCM_BASE_PTR,0) = MCM_MATCR_REG(MCM_BASE_PTR,0) + 1;
  MCM_MATCR(0) = MCM_MATCR(0) + 1;
  (void)MCM_MATCR_ATC0_MASK;
  (void)MCM_MATCR_ATC0_SHIFT;
  (void)MCM_MATCR_ATC0(1);
  MCM_MATCR0 |= MCM_MATCR_ATC0_MASK;
  MCM_MATCR0 &= ~(1U << MCM_MATCR_ATC0_SHIFT);
  (void)MCM_MATCR_RO0_MASK;
  (void)MCM_MATCR_RO0_SHIFT;
  MCM_MATCR0 |= MCM_MATCR_RO0_MASK;
  MCM_MATCR0 &= ~(1U << MCM_MATCR_RO0_SHIFT);
  (void)MCM_MATCR_ATC2_MASK;
  (void)MCM_MATCR_ATC2_SHIFT;
  (void)MCM_MATCR_ATC2(1);
  MCM_MATCR0 |= MCM_MATCR_ATC2_MASK;
  MCM_MATCR0 &= ~(1U << MCM_MATCR_ATC2_SHIFT);
  (void)MCM_MATCR_RO2_MASK;
  (void)MCM_MATCR_RO2_SHIFT;
  MCM_MATCR0 |= MCM_MATCR_RO2_MASK;
  MCM_MATCR0 &= ~(1U << MCM_MATCR_RO2_SHIFT);
}

void test_MPU(void) {
  (void)MPU_BASE_PTR;
  MPU_CESR = MPU_CESR + 1;
  MPU_RGD0_WORD0 = MPU_RGD0_WORD0 + 1;
  MPU_RGD0_WORD1 = MPU_RGD0_WORD1 + 1;
  MPU_RGD0_WORD2 = MPU_RGD0_WORD2 + 1;
  MPU_RGD0_WORD3 = MPU_RGD0_WORD3 + 1;
  MPU_RGD1_WORD0 = MPU_RGD1_WORD0 + 1;
  MPU_RGD1_WORD1 = MPU_RGD1_WORD1 + 1;
  MPU_RGD1_WORD2 = MPU_RGD1_WORD2 + 1;
  MPU_RGD1_WORD3 = MPU_RGD1_WORD3 + 1;
  MPU_RGD2_WORD0 = MPU_RGD2_WORD0 + 1;
  MPU_RGD2_WORD1 = MPU_RGD2_WORD1 + 1;
  MPU_RGD2_WORD2 = MPU_RGD2_WORD2 + 1;
  MPU_RGD2_WORD3 = MPU_RGD2_WORD3 + 1;
  MPU_RGD3_WORD0 = MPU_RGD3_WORD0 + 1;
  MPU_RGD3_WORD1 = MPU_RGD3_WORD1 + 1;
  MPU_RGD3_WORD2 = MPU_RGD3_WORD2 + 1;
  MPU_RGD3_WORD3 = MPU_RGD3_WORD3 + 1;
  MPU_RGD4_WORD0 = MPU_RGD4_WORD0 + 1;
  MPU_RGD4_WORD1 = MPU_RGD4_WORD1 + 1;
  MPU_RGD4_WORD2 = MPU_RGD4_WORD2 + 1;
  MPU_RGD4_WORD3 = MPU_RGD4_WORD3 + 1;
  MPU_RGD5_WORD0 = MPU_RGD5_WORD0 + 1;
  MPU_RGD5_WORD1 = MPU_RGD5_WORD1 + 1;
  MPU_RGD5_WORD2 = MPU_RGD5_WORD2 + 1;
  MPU_RGD5_WORD3 = MPU_RGD5_WORD3 + 1;
  MPU_RGD6_WORD0 = MPU_RGD6_WORD0 + 1;
  MPU_RGD6_WORD1 = MPU_RGD6_WORD1 + 1;
  MPU_RGD6_WORD2 = MPU_RGD6_WORD2 + 1;
  MPU_RGD6_WORD3 = MPU_RGD6_WORD3 + 1;
  MPU_RGD7_WORD0 = MPU_RGD7_WORD0 + 1;
  MPU_RGD7_WORD1 = MPU_RGD7_WORD1 + 1;
  MPU_RGD7_WORD2 = MPU_RGD7_WORD2 + 1;
  MPU_RGD7_WORD3 = MPU_RGD7_WORD3 + 1;
  MPU_RGDAAC0 = MPU_RGDAAC0 + 1;
  MPU_RGDAAC1 = MPU_RGDAAC1 + 1;
  MPU_RGDAAC2 = MPU_RGDAAC2 + 1;
  MPU_RGDAAC3 = MPU_RGDAAC3 + 1;
  MPU_RGDAAC4 = MPU_RGDAAC4 + 1;
  MPU_RGDAAC5 = MPU_RGDAAC5 + 1;
  MPU_RGDAAC6 = MPU_RGDAAC6 + 1;
  MPU_RGDAAC7 = MPU_RGDAAC7 + 1;
  MPU_CESR_REG(MPU_BASE_PTR) = MPU_CESR_REG(MPU_BASE_PTR) + 1;
  (void)MPU_CESR_VLD_MASK;
  (void)MPU_CESR_VLD_SHIFT;
  MPU_CESR |= MPU_CESR_VLD_MASK;
  MPU_CESR &= ~(1U << MPU_CESR_VLD_SHIFT);
  (void)MPU_CESR_NRGD_MASK;
  (void)MPU_CESR_NRGD_SHIFT;
  (void)MPU_CESR_NRGD(1);
  MPU_CESR |= MPU_CESR_NRGD_MASK;
  MPU_CESR &= ~(1U << MPU_CESR_NRGD_SHIFT);
  (void)MPU_CESR_NSP_MASK;
  (void)MPU_CESR_NSP_SHIFT;
  (void)MPU_CESR_NSP(1);
  MPU_CESR |= MPU_CESR_NSP_MASK;
  MPU_CESR &= ~(1U << MPU_CESR_NSP_SHIFT);
  (void)MPU_CESR_HRL_MASK;
  (void)MPU_CESR_HRL_SHIFT;
  (void)MPU_CESR_HRL(1);
  MPU_CESR |= MPU_CESR_HRL_MASK;
  MPU_CESR &= ~(1U << MPU_CESR_HRL_SHIFT);
  (void)MPU_CESR_SPERR_MASK;
  (void)MPU_CESR_SPERR_SHIFT;
  (void)MPU_CESR_SPERR(1);
  MPU_CESR |= MPU_CESR_SPERR_MASK;
  MPU_CESR &= ~(1U << MPU_CESR_SPERR_SHIFT);
  (void)MPU_EAR_EADDR_MASK;
  (void)MPU_EAR_EADDR_SHIFT;
  (void)MPU_EAR_EADDR(1);
  MPU_EAR0 |= MPU_EAR_EADDR_MASK;
  MPU_EAR0 &= ~(1U << MPU_EAR_EADDR_SHIFT);
  (void)MPU_EDR_ERW_MASK;
  (void)MPU_EDR_ERW_SHIFT;
  MPU_EDR0 |= MPU_EDR_ERW_MASK;
  MPU_EDR0 &= ~(1U << MPU_EDR_ERW_SHIFT);
  (void)MPU_EDR_EATTR_MASK;
  (void)MPU_EDR_EATTR_SHIFT;
  (void)MPU_EDR_EATTR(1);
  MPU_EDR0 |= MPU_EDR_EATTR_MASK;
  MPU_EDR0 &= ~(1U << MPU_EDR_EATTR_SHIFT);
  (void)MPU_EDR_EMN_MASK;
  (void)MPU_EDR_EMN_SHIFT;
  (void)MPU_EDR_EMN(1);
  MPU_EDR0 |= MPU_EDR_EMN_MASK;
  MPU_EDR0 &= ~(1U << MPU_EDR_EMN_SHIFT);
  (void)MPU_EDR_EPID_MASK;
  (void)MPU_EDR_EPID_SHIFT;
  (void)MPU_EDR_EPID(1);
  MPU_EDR0 |= MPU_EDR_EPID_MASK;
  MPU_EDR0 &= ~(1U << MPU_EDR_EPID_SHIFT);
  (void)MPU_EDR_EACD_MASK;
  (void)MPU_EDR_EACD_SHIFT;
  (void)MPU_EDR_EACD(1);
  MPU_EDR0 |= MPU_EDR_EACD_MASK;
  MPU_EDR0 &= ~(1U << MPU_EDR_EACD_SHIFT);
  MPU_WORD_REG(MPU_BASE_PTR,0,0) = MPU_WORD_REG(MPU_BASE_PTR,0,0) + 1;
  MPU_WORD(0,0) = MPU_WORD(0,0) + 1;
  (void)MPU_WORD_VLD_MASK;
  (void)MPU_WORD_VLD_SHIFT;
  MPU_RGD0_WORD0 |= MPU_WORD_VLD_MASK;
  MPU_RGD0_WORD0 &= ~(1U << MPU_WORD_VLD_SHIFT);
  (void)MPU_WORD_M0UM_MASK;
  (void)MPU_WORD_M0UM_SHIFT;
  (void)MPU_WORD_M0UM(1);
  MPU_RGD0_WORD0 |= MPU_WORD_M0UM_MASK;
  MPU_RGD0_WORD0 &= ~(1U << MPU_WORD_M0UM_SHIFT);
  (void)MPU_WORD_M0SM_MASK;
  (void)MPU_WORD_M0SM_SHIFT;
  (void)MPU_WORD_M0SM(1);
  MPU_RGD0_WORD0 |= MPU_WORD_M0SM_MASK;
  MPU_RGD0_WORD0 &= ~(1U << MPU_WORD_M0SM_SHIFT);
  (void)MPU_WORD_M0PE_MASK;
  (void)MPU_WORD_M0PE_SHIFT;
  MPU_RGD0_WORD0 |= MPU_WORD_M0PE_MASK;
  MPU_RGD0_WORD0 &= ~(1U << MPU_WORD_M0PE_SHIFT);
  (void)MPU_WORD_ENDADDR_MASK;
  (void)MPU_WORD_ENDADDR_SHIFT;
  (void)MPU_WORD_ENDADDR(1);
  MPU_RGD0_WORD0 |= MPU_WORD_ENDADDR_MASK;
  MPU_RGD0_WORD0 &= ~(1U << MPU_WORD_ENDADDR_SHIFT);
  (void)MPU_WORD_SRTADDR_MASK;
  (void)MPU_WORD_SRTADDR_SHIFT;
  (void)MPU_WORD_SRTADDR(1);
  MPU_RGD0_WORD0 |= MPU_WORD_SRTADDR_MASK;
  MPU_RGD0_WORD0 &= ~(1U << MPU_WORD_SRTADDR_SHIFT);
  (void)MPU_WORD_M1UM_MASK;
  (void)MPU_WORD_M1UM_SHIFT;
  (void)MPU_WORD_M1UM(1);
  MPU_RGD0_WORD0 |= MPU_WORD_M1UM_MASK;
  MPU_RGD0_WORD0 &= ~(1U << MPU_WORD_M1UM_SHIFT);
  (void)MPU_WORD_M1SM_MASK;
  (void)MPU_WORD_M1SM_SHIFT;
  (void)MPU_WORD_M1SM(1);
  MPU_RGD0_WORD0 |= MPU_WORD_M1SM_MASK;
  MPU_RGD0_WORD0 &= ~(1U << MPU_WORD_M1SM_SHIFT);
  (void)MPU_WORD_M1PE_MASK;
  (void)MPU_WORD_M1PE_SHIFT;
  MPU_RGD0_WORD0 |= MPU_WORD_M1PE_MASK;
  MPU_RGD0_WORD0 &= ~(1U << MPU_WORD_M1PE_SHIFT);
  (void)MPU_WORD_M2UM_MASK;
  (void)MPU_WORD_M2UM_SHIFT;
  (void)MPU_WORD_M2UM(1);
  MPU_RGD0_WORD0 |= MPU_WORD_M2UM_MASK;
  MPU_RGD0_WORD0 &= ~(1U << MPU_WORD_M2UM_SHIFT);
  (void)MPU_WORD_M2SM_MASK;
  (void)MPU_WORD_M2SM_SHIFT;
  (void)MPU_WORD_M2SM(1);
  MPU_RGD0_WORD0 |= MPU_WORD_M2SM_MASK;
  MPU_RGD0_WORD0 &= ~(1U << MPU_WORD_M2SM_SHIFT);
  (void)MPU_WORD_PIDMASK_MASK;
  (void)MPU_WORD_PIDMASK_SHIFT;
  (void)MPU_WORD_PIDMASK(1);
  MPU_RGD0_WORD0 |= MPU_WORD_PIDMASK_MASK;
  MPU_RGD0_WORD0 &= ~(1U << MPU_WORD_PIDMASK_SHIFT);
  (void)MPU_WORD_M2PE_MASK;
  (void)MPU_WORD_M2PE_SHIFT;
  MPU_RGD0_WORD0 |= MPU_WORD_M2PE_MASK;
  MPU_RGD0_WORD0 &= ~(1U << MPU_WORD_M2PE_SHIFT);
  (void)MPU_WORD_M3UM_MASK;
  (void)MPU_WORD_M3UM_SHIFT;
  (void)MPU_WORD_M3UM(1);
  MPU_RGD0_WORD0 |= MPU_WORD_M3UM_MASK;
  MPU_RGD0_WORD0 &= ~(1U << MPU_WORD_M3UM_SHIFT);
  (void)MPU_WORD_M3SM_MASK;
  (void)MPU_WORD_M3SM_SHIFT;
  (void)MPU_WORD_M3SM(1);
  MPU_RGD0_WORD0 |= MPU_WORD_M3SM_MASK;
  MPU_RGD0_WORD0 &= ~(1U << MPU_WORD_M3SM_SHIFT);
  (void)MPU_WORD_M3PE_MASK;
  (void)MPU_WORD_M3PE_SHIFT;
  MPU_RGD0_WORD0 |= MPU_WORD_M3PE_MASK;
  MPU_RGD0_WORD0 &= ~(1U << MPU_WORD_M3PE_SHIFT);
  (void)MPU_WORD_PID_MASK;
  (void)MPU_WORD_PID_SHIFT;
  (void)MPU_WORD_PID(1);
  MPU_RGD0_WORD0 |= MPU_WORD_PID_MASK;
  MPU_RGD0_WORD0 &= ~(1U << MPU_WORD_PID_SHIFT);
  (void)MPU_WORD_M4WE_MASK;
  (void)MPU_WORD_M4WE_SHIFT;
  MPU_RGD0_WORD0 |= MPU_WORD_M4WE_MASK;
  MPU_RGD0_WORD0 &= ~(1U << MPU_WORD_M4WE_SHIFT);
  (void)MPU_WORD_M4RE_MASK;
  (void)MPU_WORD_M4RE_SHIFT;
  MPU_RGD0_WORD0 |= MPU_WORD_M4RE_MASK;
  MPU_RGD0_WORD0 &= ~(1U << MPU_WORD_M4RE_SHIFT);
  (void)MPU_WORD_M5WE_MASK;
  (void)MPU_WORD_M5WE_SHIFT;
  MPU_RGD0_WORD0 |= MPU_WORD_M5WE_MASK;
  MPU_RGD0_WORD0 &= ~(1U << MPU_WORD_M5WE_SHIFT);
  (void)MPU_WORD_M5RE_MASK;
  (void)MPU_WORD_M5RE_SHIFT;
  MPU_RGD0_WORD0 |= MPU_WORD_M5RE_MASK;
  MPU_RGD0_WORD0 &= ~(1U << MPU_WORD_M5RE_SHIFT);
  (void)MPU_WORD_M6WE_MASK;
  (void)MPU_WORD_M6WE_SHIFT;
  MPU_RGD0_WORD0 |= MPU_WORD_M6WE_MASK;
  MPU_RGD0_WORD0 &= ~(1U << MPU_WORD_M6WE_SHIFT);
  (void)MPU_WORD_M6RE_MASK;
  (void)MPU_WORD_M6RE_SHIFT;
  MPU_RGD0_WORD0 |= MPU_WORD_M6RE_MASK;
  MPU_RGD0_WORD0 &= ~(1U << MPU_WORD_M6RE_SHIFT);
  (void)MPU_WORD_M7WE_MASK;
  (void)MPU_WORD_M7WE_SHIFT;
  MPU_RGD0_WORD0 |= MPU_WORD_M7WE_MASK;
  MPU_RGD0_WORD0 &= ~(1U << MPU_WORD_M7WE_SHIFT);
  (void)MPU_WORD_M7RE_MASK;
  (void)MPU_WORD_M7RE_SHIFT;
  MPU_RGD0_WORD0 |= MPU_WORD_M7RE_MASK;
  MPU_RGD0_WORD0 &= ~(1U << MPU_WORD_M7RE_SHIFT);
  MPU_RGDAAC_REG(MPU_BASE_PTR,0) = MPU_RGDAAC_REG(MPU_BASE_PTR,0) + 1;
  MPU_RGDAAC(0) = MPU_RGDAAC(0) + 1;
  (void)MPU_RGDAAC_M0UM_MASK;
  (void)MPU_RGDAAC_M0UM_SHIFT;
  (void)MPU_RGDAAC_M0UM(1);
  MPU_RGDAAC0 |= MPU_RGDAAC_M0UM_MASK;
  MPU_RGDAAC0 &= ~(1U << MPU_RGDAAC_M0UM_SHIFT);
  (void)MPU_RGDAAC_M0SM_MASK;
  (void)MPU_RGDAAC_M0SM_SHIFT;
  (void)MPU_RGDAAC_M0SM(1);
  MPU_RGDAAC0 |= MPU_RGDAAC_M0SM_MASK;
  MPU_RGDAAC0 &= ~(1U << MPU_RGDAAC_M0SM_SHIFT);
  (void)MPU_RGDAAC_M0PE_MASK;
  (void)MPU_RGDAAC_M0PE_SHIFT;
  MPU_RGDAAC0 |= MPU_RGDAAC_M0PE_MASK;
  MPU_RGDAAC0 &= ~(1U << MPU_RGDAAC_M0PE_SHIFT);
  (void)MPU_RGDAAC_M1UM_MASK;
  (void)MPU_RGDAAC_M1UM_SHIFT;
  (void)MPU_RGDAAC_M1UM(1);
  MPU_RGDAAC0 |= MPU_RGDAAC_M1UM_MASK;
  MPU_RGDAAC0 &= ~(1U << MPU_RGDAAC_M1UM_SHIFT);
  (void)MPU_RGDAAC_M1SM_MASK;
  (void)MPU_RGDAAC_M1SM_SHIFT;
  (void)MPU_RGDAAC_M1SM(1);
  MPU_RGDAAC0 |= MPU_RGDAAC_M1SM_MASK;
  MPU_RGDAAC0 &= ~(1U << MPU_RGDAAC_M1SM_SHIFT);
  (void)MPU_RGDAAC_M1PE_MASK;
  (void)MPU_RGDAAC_M1PE_SHIFT;
  MPU_RGDAAC0 |= MPU_RGDAAC_M1PE_MASK;
  MPU_RGDAAC0 &= ~(1U << MPU_RGDAAC_M1PE_SHIFT);
  (void)MPU_RGDAAC_M2UM_MASK;
  (void)MPU_RGDAAC_M2UM_SHIFT;
  (void)MPU_RGDAAC_M2UM(1);
  MPU_RGDAAC0 |= MPU_RGDAAC_M2UM_MASK;
  MPU_RGDAAC0 &= ~(1U << MPU_RGDAAC_M2UM_SHIFT);
  (void)MPU_RGDAAC_M2SM_MASK;
  (void)MPU_RGDAAC_M2SM_SHIFT;
  (void)MPU_RGDAAC_M2SM(1);
  MPU_RGDAAC0 |= MPU_RGDAAC_M2SM_MASK;
  MPU_RGDAAC0 &= ~(1U << MPU_RGDAAC_M2SM_SHIFT);
  (void)MPU_RGDAAC_M2PE_MASK;
  (void)MPU_RGDAAC_M2PE_SHIFT;
  MPU_RGDAAC0 |= MPU_RGDAAC_M2PE_MASK;
  MPU_RGDAAC0 &= ~(1U << MPU_RGDAAC_M2PE_SHIFT);
  (void)MPU_RGDAAC_M3UM_MASK;
  (void)MPU_RGDAAC_M3UM_SHIFT;
  (void)MPU_RGDAAC_M3UM(1);
  MPU_RGDAAC0 |= MPU_RGDAAC_M3UM_MASK;
  MPU_RGDAAC0 &= ~(1U << MPU_RGDAAC_M3UM_SHIFT);
  (void)MPU_RGDAAC_M3SM_MASK;
  (void)MPU_RGDAAC_M3SM_SHIFT;
  (void)MPU_RGDAAC_M3SM(1);
  MPU_RGDAAC0 |= MPU_RGDAAC_M3SM_MASK;
  MPU_RGDAAC0 &= ~(1U << MPU_RGDAAC_M3SM_SHIFT);
  (void)MPU_RGDAAC_M3PE_MASK;
  (void)MPU_RGDAAC_M3PE_SHIFT;
  MPU_RGDAAC0 |= MPU_RGDAAC_M3PE_MASK;
  MPU_RGDAAC0 &= ~(1U << MPU_RGDAAC_M3PE_SHIFT);
  (void)MPU_RGDAAC_M4WE_MASK;
  (void)MPU_RGDAAC_M4WE_SHIFT;
  MPU_RGDAAC0 |= MPU_RGDAAC_M4WE_MASK;
  MPU_RGDAAC0 &= ~(1U << MPU_RGDAAC_M4WE_SHIFT);
  (void)MPU_RGDAAC_M4RE_MASK;
  (void)MPU_RGDAAC_M4RE_SHIFT;
  MPU_RGDAAC0 |= MPU_RGDAAC_M4RE_MASK;
  MPU_RGDAAC0 &= ~(1U << MPU_RGDAAC_M4RE_SHIFT);
  (void)MPU_RGDAAC_M5WE_MASK;
  (void)MPU_RGDAAC_M5WE_SHIFT;
  MPU_RGDAAC0 |= MPU_RGDAAC_M5WE_MASK;
  MPU_RGDAAC0 &= ~(1U << MPU_RGDAAC_M5WE_SHIFT);
  (void)MPU_RGDAAC_M5RE_MASK;
  (void)MPU_RGDAAC_M5RE_SHIFT;
  MPU_RGDAAC0 |= MPU_RGDAAC_M5RE_MASK;
  MPU_RGDAAC0 &= ~(1U << MPU_RGDAAC_M5RE_SHIFT);
  (void)MPU_RGDAAC_M6WE_MASK;
  (void)MPU_RGDAAC_M6WE_SHIFT;
  MPU_RGDAAC0 |= MPU_RGDAAC_M6WE_MASK;
  MPU_RGDAAC0 &= ~(1U << MPU_RGDAAC_M6WE_SHIFT);
  (void)MPU_RGDAAC_M6RE_MASK;
  (void)MPU_RGDAAC_M6RE_SHIFT;
  MPU_RGDAAC0 |= MPU_RGDAAC_M6RE_MASK;
  MPU_RGDAAC0 &= ~(1U << MPU_RGDAAC_M6RE_SHIFT);
  (void)MPU_RGDAAC_M7WE_MASK;
  (void)MPU_RGDAAC_M7WE_SHIFT;
  MPU_RGDAAC0 |= MPU_RGDAAC_M7WE_MASK;
  MPU_RGDAAC0 &= ~(1U << MPU_RGDAAC_M7WE_SHIFT);
  (void)MPU_RGDAAC_M7RE_MASK;
  (void)MPU_RGDAAC_M7RE_SHIFT;
  MPU_RGDAAC0 |= MPU_RGDAAC_M7RE_MASK;
  MPU_RGDAAC0 &= ~(1U << MPU_RGDAAC_M7RE_SHIFT);
}

