kuafusoft/source_code/application/jqgrid/mcu/zzvw_device_ver/mcu_header_file/CWMCUS_V10_6_Kinetis_50MHz_KM1x_KM3x_FINAL_DROP_140717/_Test_Files/Test_MKM14Z5_v1_2.c
void test_MTB(void) {
  (void)MTB_BASE_PTR;
  MTB_POSITION = MTB_POSITION + 1;
  MTB_MASTER = MTB_MASTER + 1;
  MTB_FLOW = MTB_FLOW + 1;
  MTB_POSITION_REG(MTB_BASE_PTR) = MTB_POSITION_REG(MTB_BASE_PTR) + 1;
  (void)MTB_POSITION_WRAP_MASK;
  (void)MTB_POSITION_WRAP_SHIFT;
  MTB_POSITION |= MTB_POSITION_WRAP_MASK;
  MTB_POSITION &= ~(1U << MTB_POSITION_WRAP_SHIFT);
  (void)MTB_POSITION_POINTER_MASK;
  (void)MTB_POSITION_POINTER_SHIFT;
  (void)MTB_POSITION_POINTER(1);
  MTB_POSITION |= MTB_POSITION_POINTER_MASK;
  MTB_POSITION &= ~(1U << MTB_POSITION_POINTER_SHIFT);
  MTB_MASTER_REG(MTB_BASE_PTR) = MTB_MASTER_REG(MTB_BASE_PTR) + 1;
  (void)MTB_MASTER_MASK_MASK;
  (void)MTB_MASTER_MASK_SHIFT;
  (void)MTB_MASTER_MASK(1);
  MTB_MASTER |= MTB_MASTER_MASK_MASK;
  MTB_MASTER &= ~(1U << MTB_MASTER_MASK_SHIFT);
  (void)MTB_MASTER_TSTARTEN_MASK;
  (void)MTB_MASTER_TSTARTEN_SHIFT;
  MTB_MASTER |= MTB_MASTER_TSTARTEN_MASK;
  MTB_MASTER &= ~(1U << MTB_MASTER_TSTARTEN_SHIFT);
  (void)MTB_MASTER_TSTOPEN_MASK;
  (void)MTB_MASTER_TSTOPEN_SHIFT;
  MTB_MASTER |= MTB_MASTER_TSTOPEN_MASK;
  MTB_MASTER &= ~(1U << MTB_MASTER_TSTOPEN_SHIFT);
  (void)MTB_MASTER_SFRWPRIV_MASK;
  (void)MTB_MASTER_SFRWPRIV_SHIFT;
  MTB_MASTER |= MTB_MASTER_SFRWPRIV_MASK;
  MTB_MASTER &= ~(1U << MTB_MASTER_SFRWPRIV_SHIFT);
  (void)MTB_MASTER_RAMPRIV_MASK;
  (void)MTB_MASTER_RAMPRIV_SHIFT;
  MTB_MASTER |= MTB_MASTER_RAMPRIV_MASK;
  MTB_MASTER &= ~(1U << MTB_MASTER_RAMPRIV_SHIFT);
  (void)MTB_MASTER_HALTREQ_MASK;
  (void)MTB_MASTER_HALTREQ_SHIFT;
  MTB_MASTER |= MTB_MASTER_HALTREQ_MASK;
  MTB_MASTER &= ~(1U << MTB_MASTER_HALTREQ_SHIFT);
  (void)MTB_MASTER_EN_MASK;
  (void)MTB_MASTER_EN_SHIFT;
  MTB_MASTER |= MTB_MASTER_EN_MASK;
  MTB_MASTER &= ~(1U << MTB_MASTER_EN_SHIFT);
  MTB_FLOW_REG(MTB_BASE_PTR) = MTB_FLOW_REG(MTB_BASE_PTR) + 1;
  (void)MTB_FLOW_AUTOSTOP_MASK;
  (void)MTB_FLOW_AUTOSTOP_SHIFT;
  MTB_FLOW |= MTB_FLOW_AUTOSTOP_MASK;
  MTB_FLOW &= ~(1U << MTB_FLOW_AUTOSTOP_SHIFT);
  (void)MTB_FLOW_AUTOHALT_MASK;
  (void)MTB_FLOW_AUTOHALT_SHIFT;
  MTB_FLOW |= MTB_FLOW_AUTOHALT_MASK;
  MTB_FLOW &= ~(1U << MTB_FLOW_AUTOHALT_SHIFT);
  (void)MTB_FLOW_WATERMARK_MASK;
  (void)MTB_FLOW_WATERMARK_SHIFT;
  (void)MTB_FLOW_WATERMARK(1);
  MTB_FLOW |= MTB_FLOW_WATERMARK_MASK;
  MTB_FLOW &= ~(1U << MTB_FLOW_WATERMARK_SHIFT);
  (void)MTB_BASE_BASEADDR_MASK;
  (void)MTB_BASE_BASEADDR_SHIFT;
  (void)MTB_BASE_BASEADDR(1);
  MTB_BASE |= MTB_BASE_BASEADDR_MASK;
  MTB_BASE &= ~(1U << MTB_BASE_BASEADDR_SHIFT);
  (void)MTB_MODECTRL_MODECTRL_MASK;
  (void)MTB_MODECTRL_MODECTRL_SHIFT;
  (void)MTB_MODECTRL_MODECTRL(1);
  MTB_MODECTRL |= MTB_MODECTRL_MODECTRL_MASK;
  MTB_MODECTRL &= ~(1U << MTB_MODECTRL_MODECTRL_SHIFT);
  (void)MTB_TAGSET_TAGSET_MASK;
  (void)MTB_TAGSET_TAGSET_SHIFT;
  (void)MTB_TAGSET_TAGSET(1);
  MTB_TAGSET |= MTB_TAGSET_TAGSET_MASK;
  MTB_TAGSET &= ~(1U << MTB_TAGSET_TAGSET_SHIFT);
  (void)MTB_TAGCLEAR_TAGCLEAR_MASK;
  (void)MTB_TAGCLEAR_TAGCLEAR_SHIFT;
  (void)MTB_TAGCLEAR_TAGCLEAR(1);
  MTB_TAGCLEAR |= MTB_TAGCLEAR_TAGCLEAR_MASK;
  MTB_TAGCLEAR &= ~(1U << MTB_TAGCLEAR_TAGCLEAR_SHIFT);
  (void)MTB_LOCKACCESS_LOCKACCESS_MASK;
  (void)MTB_LOCKACCESS_LOCKACCESS_SHIFT;
  (void)MTB_LOCKACCESS_LOCKACCESS(1);
  MTB_LOCKACCESS |= MTB_LOCKACCESS_LOCKACCESS_MASK;
  MTB_LOCKACCESS &= ~(1U << MTB_LOCKACCESS_LOCKACCESS_SHIFT);
  (void)MTB_LOCKSTAT_LOCKSTAT_MASK;
  (void)MTB_LOCKSTAT_LOCKSTAT_SHIFT;
  (void)MTB_LOCKSTAT_LOCKSTAT(1);
  MTB_LOCKSTAT |= MTB_LOCKSTAT_LOCKSTAT_MASK;
  MTB_LOCKSTAT &= ~(1U << MTB_LOCKSTAT_LOCKSTAT_SHIFT);
  (void)MTB_AUTHSTAT_BIT0_MASK;
  (void)MTB_AUTHSTAT_BIT0_SHIFT;
  MTB_AUTHSTAT |= MTB_AUTHSTAT_BIT0_MASK;
  MTB_AUTHSTAT &= ~(1U << MTB_AUTHSTAT_BIT0_SHIFT);
  (void)MTB_AUTHSTAT_BIT1_MASK;
  (void)MTB_AUTHSTAT_BIT1_SHIFT;
  MTB_AUTHSTAT |= MTB_AUTHSTAT_BIT1_MASK;
  MTB_AUTHSTAT &= ~(1U << MTB_AUTHSTAT_BIT1_SHIFT);
  (void)MTB_AUTHSTAT_BIT2_MASK;
  (void)MTB_AUTHSTAT_BIT2_SHIFT;
  MTB_AUTHSTAT |= MTB_AUTHSTAT_BIT2_MASK;
  MTB_AUTHSTAT &= ~(1U << MTB_AUTHSTAT_BIT2_SHIFT);
  (void)MTB_AUTHSTAT_BIT3_MASK;
  (void)MTB_AUTHSTAT_BIT3_SHIFT;
  MTB_AUTHSTAT |= MTB_AUTHSTAT_BIT3_MASK;
  MTB_AUTHSTAT &= ~(1U << MTB_AUTHSTAT_BIT3_SHIFT);
  (void)MTB_DEVICEARCH_DEVICEARCH_MASK;
  (void)MTB_DEVICEARCH_DEVICEARCH_SHIFT;
  (void)MTB_DEVICEARCH_DEVICEARCH(1);
  MTB_DEVICEARCH |= MTB_DEVICEARCH_DEVICEARCH_MASK;
  MTB_DEVICEARCH &= ~(1U << MTB_DEVICEARCH_DEVICEARCH_SHIFT);
  (void)MTB_DEVICECFG_DEVICECFG_MASK;
  (void)MTB_DEVICECFG_DEVICECFG_SHIFT;
  (void)MTB_DEVICECFG_DEVICECFG(1);
  MTB_DEVICECFG |= MTB_DEVICECFG_DEVICECFG_MASK;
  MTB_DEVICECFG &= ~(1U << MTB_DEVICECFG_DEVICECFG_SHIFT);
  (void)MTB_DEVICETYPID_DEVICETYPID_MASK;
  (void)MTB_DEVICETYPID_DEVICETYPID_SHIFT;
  (void)MTB_DEVICETYPID_DEVICETYPID(1);
  MTB_DEVICETYPID |= MTB_DEVICETYPID_DEVICETYPID_MASK;
  MTB_DEVICETYPID &= ~(1U << MTB_DEVICETYPID_DEVICETYPID_SHIFT);
  (void)MTB_PERIPHID_PERIPHID_MASK;
  (void)MTB_PERIPHID_PERIPHID_SHIFT;
  (void)MTB_PERIPHID_PERIPHID(1);
  MTB_PERIPHID4 |= MTB_PERIPHID_PERIPHID_MASK;
  MTB_PERIPHID4 &= ~(1U << MTB_PERIPHID_PERIPHID_SHIFT);
  (void)MTB_COMPID_COMPID_MASK;
  (void)MTB_COMPID_COMPID_SHIFT;
  (void)MTB_COMPID_COMPID(1);
  MTB_COMPID0 |= MTB_COMPID_COMPID_MASK;
  MTB_COMPID0 &= ~(1U << MTB_COMPID_COMPID_SHIFT);
}

void test_MTBDWT(void) {
  (void)MTBDWT_BASE_PTR;
  MTBDWT_COMP0 = MTBDWT_COMP0 + 1;
  MTBDWT_MASK0 = MTBDWT_MASK0 + 1;
  MTBDWT_FCT0 = MTBDWT_FCT0 + 1;
  MTBDWT_COMP1 = MTBDWT_COMP1 + 1;
  MTBDWT_MASK1 = MTBDWT_MASK1 + 1;
  MTBDWT_FCT1 = MTBDWT_FCT1 + 1;
  MTBDWT_TBCTRL = MTBDWT_TBCTRL + 1;
  (void)MTBDWT_CTRL_DWTCFGCTRL_MASK;
  (void)MTBDWT_CTRL_DWTCFGCTRL_SHIFT;
  (void)MTBDWT_CTRL_DWTCFGCTRL(1);
  MTBDWT_CTRL |= MTBDWT_CTRL_DWTCFGCTRL_MASK;
  MTBDWT_CTRL &= ~(1U << MTBDWT_CTRL_DWTCFGCTRL_SHIFT);
  (void)MTBDWT_CTRL_NUMCMP_MASK;
  (void)MTBDWT_CTRL_NUMCMP_SHIFT;
  (void)MTBDWT_CTRL_NUMCMP(1);
  MTBDWT_CTRL |= MTBDWT_CTRL_NUMCMP_MASK;
  MTBDWT_CTRL &= ~(1U << MTBDWT_CTRL_NUMCMP_SHIFT);
  MTBDWT_COMP_REG(MTBDWT_BASE_PTR,0) = MTBDWT_COMP_REG(MTBDWT_BASE_PTR,0) + 1;
  MTBDWT_COMP(0) = MTBDWT_COMP(0) + 1;
  (void)MTBDWT_COMP_COMP_MASK;
  (void)MTBDWT_COMP_COMP_SHIFT;
  (void)MTBDWT_COMP_COMP(1);
  MTBDWT_COMP0 |= MTBDWT_COMP_COMP_MASK;
  MTBDWT_COMP0 &= ~(1U << MTBDWT_COMP_COMP_SHIFT);
  MTBDWT_MASK_REG(MTBDWT_BASE_PTR,0) = MTBDWT_MASK_REG(MTBDWT_BASE_PTR,0) + 1;
  MTBDWT_MASK(0) = MTBDWT_MASK(0) + 1;
  (void)MTBDWT_MASK_MASK_MASK;
  (void)MTBDWT_MASK_MASK_SHIFT;
  (void)MTBDWT_MASK_MASK(1);
  MTBDWT_MASK0 |= MTBDWT_MASK_MASK_MASK;
  MTBDWT_MASK0 &= ~(1U << MTBDWT_MASK_MASK_SHIFT);
  MTBDWT_FCT_REG(MTBDWT_BASE_PTR,0) = MTBDWT_FCT_REG(MTBDWT_BASE_PTR,0) + 1;
  MTBDWT_FCT(0) = MTBDWT_FCT(0) + 1;
  (void)MTBDWT_FCT_FUNCTION_MASK;
  (void)MTBDWT_FCT_FUNCTION_SHIFT;
  (void)MTBDWT_FCT_FUNCTION(1);
  MTBDWT_FCT0 |= MTBDWT_FCT_FUNCTION_MASK;
  MTBDWT_FCT0 &= ~(1U << MTBDWT_FCT_FUNCTION_SHIFT);
  (void)MTBDWT_FCT_DATAVMATCH_MASK;
  (void)MTBDWT_FCT_DATAVMATCH_SHIFT;
  MTBDWT_FCT0 |= MTBDWT_FCT_DATAVMATCH_MASK;
  MTBDWT_FCT0 &= ~(1U << MTBDWT_FCT_DATAVMATCH_SHIFT);
  (void)MTBDWT_FCT_DATAVSIZE_MASK;
  (void)MTBDWT_FCT_DATAVSIZE_SHIFT;
  (void)MTBDWT_FCT_DATAVSIZE(1);
  MTBDWT_FCT0 |= MTBDWT_FCT_DATAVSIZE_MASK;
  MTBDWT_FCT0 &= ~(1U << MTBDWT_FCT_DATAVSIZE_SHIFT);
  (void)MTBDWT_FCT_DATAVADDR0_MASK;
  (void)MTBDWT_FCT_DATAVADDR0_SHIFT;
  (void)MTBDWT_FCT_DATAVADDR0(1);
  MTBDWT_FCT0 |= MTBDWT_FCT_DATAVADDR0_MASK;
  MTBDWT_FCT0 &= ~(1U << MTBDWT_FCT_DATAVADDR0_SHIFT);
  (void)MTBDWT_FCT_MATCHED_MASK;
  (void)MTBDWT_FCT_MATCHED_SHIFT;
  MTBDWT_FCT0 |= MTBDWT_FCT_MATCHED_MASK;
  MTBDWT_FCT0 &= ~(1U << MTBDWT_FCT_MATCHED_SHIFT);
  MTBDWT_TBCTRL_REG(MTBDWT_BASE_PTR) = MTBDWT_TBCTRL_REG(MTBDWT_BASE_PTR) + 1;
  (void)MTBDWT_TBCTRL_ACOMP0_MASK;
  (void)MTBDWT_TBCTRL_ACOMP0_SHIFT;
  MTBDWT_TBCTRL |= MTBDWT_TBCTRL_ACOMP0_MASK;
  MTBDWT_TBCTRL &= ~(1U << MTBDWT_TBCTRL_ACOMP0_SHIFT);
  (void)MTBDWT_TBCTRL_ACOMP1_MASK;
  (void)MTBDWT_TBCTRL_ACOMP1_SHIFT;
  MTBDWT_TBCTRL |= MTBDWT_TBCTRL_ACOMP1_MASK;
  MTBDWT_TBCTRL &= ~(1U << MTBDWT_TBCTRL_ACOMP1_SHIFT);
  (void)MTBDWT_TBCTRL_NUMCOMP_MASK;
  (void)MTBDWT_TBCTRL_NUMCOMP_SHIFT;
  (void)MTBDWT_TBCTRL_NUMCOMP(1);
  MTBDWT_TBCTRL |= MTBDWT_TBCTRL_NUMCOMP_MASK;
  MTBDWT_TBCTRL &= ~(1U << MTBDWT_TBCTRL_NUMCOMP_SHIFT);
  (void)MTBDWT_DEVICECFG_DEVICECFG_MASK;
  (void)MTBDWT_DEVICECFG_DEVICECFG_SHIFT;
  (void)MTBDWT_DEVICECFG_DEVICECFG(1);
  MTBDWT_DEVICECFG |= MTBDWT_DEVICECFG_DEVICECFG_MASK;
  MTBDWT_DEVICECFG &= ~(1U << MTBDWT_DEVICECFG_DEVICECFG_SHIFT);
  (void)MTBDWT_DEVICETYPID_DEVICETYPID_MASK;
  (void)MTBDWT_DEVICETYPID_DEVICETYPID_SHIFT;
  (void)MTBDWT_DEVICETYPID_DEVICETYPID(1);
  MTBDWT_DEVICETYPID |= MTBDWT_DEVICETYPID_DEVICETYPID_MASK;
  MTBDWT_DEVICETYPID &= ~(1U << MTBDWT_DEVICETYPID_DEVICETYPID_SHIFT);
  (void)MTBDWT_PERIPHID_PERIPHID_MASK;
  (void)MTBDWT_PERIPHID_PERIPHID_SHIFT;
  (void)MTBDWT_PERIPHID_PERIPHID(1);
  MTBDWT_PERIPHID4 |= MTBDWT_PERIPHID_PERIPHID_MASK;
  MTBDWT_PERIPHID4 &= ~(1U << MTBDWT_PERIPHID_PERIPHID_SHIFT);
  (void)MTBDWT_COMPID_COMPID_MASK;
  (void)MTBDWT_COMPID_COMPID_SHIFT;
  (void)MTBDWT_COMPID_COMPID(1);
  MTBDWT_COMPID0 |= MTBDWT_COMPID_COMPID_MASK;
  MTBDWT_COMPID0 &= ~(1U << MTBDWT_COMPID_COMPID_SHIFT);
}

